import React, { FC } from 'react';

import Box from '../../components/Box/box';
import Title from '../../components/title/title';

type AboutProps = {};

const About: FC<AboutProps> = props => {
  return (
    <Box>
      <Title title={'Про нас'} before after />
      <p>
        «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
        аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів. Тому
        навіть складний ковідний період, світова пандемія не стали на заваді
        успішному старту. Отже, ми — сміливі, ми — драйвові, ми — ті, що
        розвивають рослинництво та допомагають ставати успішними тисячам
        вітчизняних аграріїв. Бачення: компанія ТОВ “ДАМАР АГРОТРЕЙД” тримає
        курс на підвищення престижності, довіри до засобів захисту рослин made
        in UA. Прагнемо, аби в кожному регіоні України наш споживач мав доступ
        до якісної продукції та консалтингу від фахівців команди. Місія: усе
        продуктове портфоліо, консультативні послуги ТОВ “ДАМАР АГРОТРЕЙД”
        направлені на підвищення рентабельності рослинництва в мінливих
        кліматичних умовах України. Також ставимо собі завдання підвищувати
        обізнаність клієнтів щодо сучасних методів ведення рослинництва...
      </p>
      <p>Цінності</p>
      <ul>
        <li>
          прозорість ділових стосунків з колегами, контрагентами, клієнтами;
        </li>
        <li>
          однаково висококласний сервіс для невеликого фермера та потужного
          холдингу;
        </li>
        <li>покращення якості товарів та послуг;</li>
        <li>
          постійна підтримка партнера на усіх етапах виробництва продукції
          рослинництва;
        </li>
        <li>екологічність у роботі, думках та цілях; </li>
        <li>підтримка вітчизняного продукту та вітчизняного виробника;</li>
        <li>постійний саморозвиток.…»</li>
      </ul>
    </Box>
  );
};

export default About;
