import React, { FC } from 'react';
import Box from '../../components/Box/box';
import {
  PartnersConteiner,
  PartnersItem,
  PartnersList,
  PartnerBox,
  Text,
  ImageBox,
  PartnerTitle,
} from './partners.style';
import Title from '../../components/title/title';

import Partner from '../../img/partner.png';

type PartnersProps = {};

const Partners: FC<PartnersProps> = props => {
  return (
    <Box>
      <PartnersConteiner>
        <Title title={'Партнери'} before after center />
        <PartnersList>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
          <PartnersItem>
            <PartnerBox>
              <ImageBox>
                <img
                  src={Partner}
                  alt="Partner"
                  width={'175px'}
                  height={'86px'}
                />
              </ImageBox>
              <PartnerTitle>ТОВ МП "Майбутнє Будуємо Разом"</PartnerTitle>
            </PartnerBox>
            <Text>
              «Компанія ТОВ “ДАМАР АГРОТРЕЙД” — молода команда, яка з’явилась на
              аграрному ринку у 2020 році. Ми не боїмось труднощів і викликів.
              Тому навіть складний ковідний період, світова пандемія не стали на
              заваді успішному старту. Отже, ми — сміливі, ми — драйвові, ми —
              ті, що розвивають рослинництво та допомагають ставати успішними
              тисячам вітчизняних аграріїв.
            </Text>
          </PartnersItem>
        </PartnersList>
      </PartnersConteiner>
    </Box>
  );
};

export default Partners;
